MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2G36J0AGV20000/mcu.h
/******************************************************************************
 ** BT Registers BT1
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_BT1_PPG_PRLL                           *((volatile uint16_t*)(0x40025040UL))
#define FM4_BT1_PPG_PRLL                          *((volatile uint16_t*)(0x40025040UL))
#define FM_BT1_PWM_PCSR                           *((volatile uint16_t*)(0x40025040UL))
#define FM4_BT1_PWM_PCSR                          *((volatile uint16_t*)(0x40025040UL))
#define FM_BT1_RT_PCSR                            *((volatile uint16_t*)(0x40025040UL))
#define FM4_BT1_RT_PCSR                           *((volatile uint16_t*)(0x40025040UL))
#define FM_BT1_PPG_PRLH                           *((volatile uint16_t*)(0x40025044UL))
#define FM4_BT1_PPG_PRLH                          *((volatile uint16_t*)(0x40025044UL))
#define FM_BT1_PWC_DTBF                           *((volatile uint16_t*)(0x40025044UL))
#define FM4_BT1_PWC_DTBF                          *((volatile uint16_t*)(0x40025044UL))
#define FM_BT1_PWM_PDUT                           *((volatile uint16_t*)(0x40025044UL))
#define FM4_BT1_PWM_PDUT                          *((volatile uint16_t*)(0x40025044UL))
#define FM_BT1_PPG_TMR                            *((volatile uint16_t*)(0x40025048UL))
#define FM4_BT1_PPG_TMR                           *((volatile uint16_t*)(0x40025048UL))
#define FM_BT1_PWM_TMR                            *((volatile uint16_t*)(0x40025048UL))
#define FM4_BT1_PWM_TMR                           *((volatile uint16_t*)(0x40025048UL))
#define FM_BT1_RT_TMR                             *((volatile uint16_t*)(0x40025048UL))
#define FM4_BT1_RT_TMR                            *((volatile uint16_t*)(0x40025048UL))
#define FM_BT1_PPG_TMCR                           *((volatile uint16_t*)(0x4002504CUL))
#define FM4_BT1_PPG_TMCR                          *((volatile uint16_t*)(0x4002504CUL))
#define FM_BT1_PWC_TMCR                           *((volatile uint16_t*)(0x4002504CUL))
#define FM4_BT1_PWC_TMCR                          *((volatile uint16_t*)(0x4002504CUL))
#define FM_BT1_PWM_TMCR                           *((volatile uint16_t*)(0x4002504CUL))
#define FM4_BT1_PWM_TMCR                          *((volatile uint16_t*)(0x4002504CUL))
#define FM_BT1_RT_TMCR                            *((volatile uint16_t*)(0x4002504CUL))
#define FM4_BT1_RT_TMCR                           *((volatile uint16_t*)(0x4002504CUL))
#define FM_BT1_PPG_STC                            *((volatile  uint8_t*)(0x40025050UL))
#define FM4_BT1_PPG_STC                           *((volatile  uint8_t*)(0x40025050UL))
#define FM_BT1_PWC_STC                            *((volatile  uint8_t*)(0x40025050UL))
#define FM4_BT1_PWC_STC                           *((volatile  uint8_t*)(0x40025050UL))
#define FM_BT1_PWM_STC                            *((volatile  uint8_t*)(0x40025050UL))
#define FM4_BT1_PWM_STC                           *((volatile  uint8_t*)(0x40025050UL))
#define FM_BT1_RT_STC                             *((volatile  uint8_t*)(0x40025050UL))
#define FM4_BT1_RT_STC                            *((volatile  uint8_t*)(0x40025050UL))
#define FM_BT1_PPG_TMCR2                          *((volatile  uint8_t*)(0x40025051UL))
#define FM4_BT1_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025051UL))
#define FM_BT1_PWC_TMCR2                          *((volatile  uint8_t*)(0x40025051UL))
#define FM4_BT1_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025051UL))
#define FM_BT1_PWM_TMCR2                          *((volatile  uint8_t*)(0x40025051UL))
#define FM4_BT1_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025051UL))
#define FM_BT1_RT_TMCR2                           *((volatile  uint8_t*)(0x40025051UL))
#define FM4_BT1_RT_TMCR2                          *((volatile  uint8_t*)(0x40025051UL))

/******************************************************************************
 ** BT Registers BT10
 ** 
 **   Register Definition
 ******************************************************************************/
#define FM_BT10_PPG_PRLL                          *((volatile uint16_t*)(0x40025480UL))
#define FM4_BT10_PPG_PRLL                         *((volatile uint16_t*)(0x40025480UL))
#define FM_BT10_PWM_PCSR                          *((volatile uint16_t*)(0x40025480UL))
#define FM4_BT10_PWM_PCSR                         *((volatile uint16_t*)(0x40025480UL))
#define FM_BT10_RT_PCSR                           *((volatile uint16_t*)(0x40025480UL))
#define FM4_BT10_RT_PCSR                          *((volatile uint16_t*)(0x40025480UL))
#define FM_BT10_PPG_PRLH                          *((volatile uint16_t*)(0x40025484UL))
#define FM4_BT10_PPG_PRLH                         *((volatile uint16_t*)(0x40025484UL))
#define FM_BT10_PWC_DTBF                          *((volatile uint16_t*)(0x40025484UL))
#define FM4_BT10_PWC_DTBF                         *((volatile uint16_t*)(0x40025484UL))
#define FM_BT10_PWM_PDUT                          *((volatile uint16_t*)(0x40025484UL))
#define FM4_BT10_PWM_PDUT                         *((volatile uint16_t*)(0x40025484UL))
#define FM_BT10_PPG_TMR                           *((volatile uint16_t*)(0x40025488UL))
#define FM4_BT10_PPG_TMR                          *((volatile uint16_t*)(0x40025488UL))
#define FM_BT10_PWM_TMR                           *((volatile uint16_t*)(0x40025488UL))
#define FM4_BT10_PWM_TMR                          *((volatile uint16_t*)(0x40025488UL))
#define FM_BT10_RT_TMR                            *((volatile uint16_t*)(0x40025488UL))
#define FM4_BT10_RT_TMR                           *((volatile uint16_t*)(0x40025488UL))
#define FM_BT10_PPG_TMCR                          *((volatile uint16_t*)(0x4002548CUL))
#define FM4_BT10_PPG_TMCR                         *((volatile uint16_t*)(0x4002548CUL))
#define FM_BT10_PWC_TMCR                          *((volatile uint16_t*)(0x4002548CUL))
#define FM4_BT10_PWC_TMCR                         *((volatile uint16_t*)(0x4002548CUL))
#define FM_BT10_PWM_TMCR                          *((volatile uint16_t*)(0x4002548CUL))
#define FM4_BT10_PWM_TMCR                         *((volatile uint16_t*)(0x4002548CUL))
#define FM_BT10_RT_TMCR                           *((volatile uint16_t*)(0x4002548CUL))
#define FM4_BT10_RT_TMCR                          *((volatile uint16_t*)(0x4002548CUL))
#define FM_BT10_PPG_STC                           *((volatile  uint8_t*)(0x40025490UL))
#define FM4_BT10_PPG_STC                          *((volatile  uint8_t*)(0x40025490UL))
#define FM_BT10_PWC_STC                           *((volatile  uint8_t*)(0x40025490UL))
#define FM4_BT10_PWC_STC                          *((volatile  uint8_t*)(0x40025490UL))
#define FM_BT10_PWM_STC                           *((volatile  uint8_t*)(0x40025490UL))
#define FM4_BT10_PWM_STC                          *((volatile  uint8_t*)(0x40025490UL))
#define FM_BT10_RT_STC                            *((volatile  uint8_t*)(0x40025490UL))
#define FM4_BT10_RT_STC                           *((volatile  uint8_t*)(0x40025490UL))
#define FM_BT10_PPG_TMCR2                         *((volatile  uint8_t*)(0x40025491UL))
#define FM4_BT10_PPG_TMCR2                        *((volatile  uint8_t*)(0x40025491UL))
#define FM_BT10_PWC_TMCR2                         *((volatile  uint8_t*)(0x40025491UL))
#define FM4_BT10_PWC_TMCR2                        *((volatile  uint8_t*)(0x40025491UL))
#define FM_BT10_PWM_TMCR2                         *((volatile  uint8_t*)(0x40025491UL))
#define FM4_BT10_PWM_TMCR2                        *((volatile  uint8_t*)(0x40025491UL))
#define FM_BT10_RT_TMCR2                          *((volatile  uint8_t*)(0x40025491UL))
#define FM4_BT10_RT_TMCR2                         *((volatile  uint8_t*)(0x40025491UL))

