MikroElektronika/core_packages/ARM/gcc_clang/def/infineon/S6E2G36J0AGV20000/mcu.h
#define bFM_MFS8_I2C_IBSR_BB                      *((volatile  uint8_t *)(0x42710080UL))
#define bFM4_MFS8_I2C_IBSR_BB                     *((volatile  uint8_t *)(0x42710080UL))
#define bFM_MFS8_I2C_IBSR_SPC                     *((volatile  uint8_t *)(0x42710084UL))
#define bFM4_MFS8_I2C_IBSR_SPC                    *((volatile  uint8_t *)(0x42710084UL))
#define bFM_MFS8_I2C_IBSR_RSC                     *((volatile  uint8_t *)(0x42710088UL))
#define bFM4_MFS8_I2C_IBSR_RSC                    *((volatile  uint8_t *)(0x42710088UL))
#define bFM_MFS8_I2C_IBSR_AL                      *((volatile  uint8_t *)(0x4271008CUL))
#define bFM4_MFS8_I2C_IBSR_AL                     *((volatile  uint8_t *)(0x4271008CUL))
#define bFM_MFS8_I2C_IBSR_TRX                     *((volatile  uint8_t *)(0x42710090UL))
#define bFM4_MFS8_I2C_IBSR_TRX                    *((volatile  uint8_t *)(0x42710090UL))
#define bFM_MFS8_I2C_IBSR_RSA                     *((volatile  uint8_t *)(0x42710094UL))
#define bFM4_MFS8_I2C_IBSR_RSA                    *((volatile  uint8_t *)(0x42710094UL))
#define bFM_MFS8_I2C_IBSR_RACK                    *((volatile  uint8_t *)(0x42710098UL))
#define bFM4_MFS8_I2C_IBSR_RACK                   *((volatile  uint8_t *)(0x42710098UL))
#define bFM_MFS8_I2C_IBSR_FBT                     *((volatile  uint8_t *)(0x4271009CUL))
#define bFM4_MFS8_I2C_IBSR_FBT                    *((volatile  uint8_t *)(0x4271009CUL))

#define bFM_MFS8_I2C_ISBA_SAEN                    *((volatile  uint8_t *)(0x4271021CUL))
#define bFM4_MFS8_I2C_ISBA_SAEN                   *((volatile  uint8_t *)(0x4271021CUL))

#define bFM_MFS8_I2C_ISMK_EN                      *((volatile  uint8_t *)(0x4271023CUL))
#define bFM4_MFS8_I2C_ISMK_EN                     *((volatile  uint8_t *)(0x4271023CUL))

#define bFM_MFS8_I2C_SMR_TIE                      *((volatile  uint8_t *)(0x42710008UL))
#define bFM4_MFS8_I2C_SMR_TIE                     *((volatile  uint8_t *)(0x42710008UL))
#define bFM_MFS8_I2C_SMR_RIE                      *((volatile  uint8_t *)(0x4271000CUL))
#define bFM4_MFS8_I2C_SMR_RIE                     *((volatile  uint8_t *)(0x4271000CUL))

#define bFM_MFS8_I2C_SSR_TBI                      *((volatile  uint8_t *)(0x427100A0UL))
#define bFM4_MFS8_I2C_SSR_TBI                     *((volatile  uint8_t *)(0x427100A0UL))
#define bFM_MFS8_I2C_SSR_TDRE                     *((volatile  uint8_t *)(0x427100A4UL))
#define bFM4_MFS8_I2C_SSR_TDRE                    *((volatile  uint8_t *)(0x427100A4UL))
#define bFM_MFS8_I2C_SSR_RDRF                     *((volatile  uint8_t *)(0x427100A8UL))
#define bFM4_MFS8_I2C_SSR_RDRF                    *((volatile  uint8_t *)(0x427100A8UL))
#define bFM_MFS8_I2C_SSR_ORE                      *((volatile  uint8_t *)(0x427100ACUL))
#define bFM4_MFS8_I2C_SSR_ORE                     *((volatile  uint8_t *)(0x427100ACUL))
#define bFM_MFS8_I2C_SSR_TBIE                     *((volatile  uint8_t *)(0x427100B0UL))
#define bFM4_MFS8_I2C_SSR_TBIE                    *((volatile  uint8_t *)(0x427100B0UL))
#define bFM_MFS8_I2C_SSR_DMA                      *((volatile  uint8_t *)(0x427100B4UL))
#define bFM4_MFS8_I2C_SSR_DMA                     *((volatile  uint8_t *)(0x427100B4UL))
#define bFM_MFS8_I2C_SSR_TSET                     *((volatile  uint8_t *)(0x427100B8UL))
#define bFM4_MFS8_I2C_SSR_TSET                    *((volatile  uint8_t *)(0x427100B8UL))
#define bFM_MFS8_I2C_SSR_REC                      *((volatile  uint8_t *)(0x427100BCUL))
#define bFM4_MFS8_I2C_SSR_REC                     *((volatile  uint8_t *)(0x427100BCUL))

#define bFM_MFS8_LIN_BGR_EXT                      *((volatile  uint8_t *)(0x427101BCUL))
#define bFM4_MFS8_LIN_BGR_EXT                     *((volatile  uint8_t *)(0x427101BCUL))

#define bFM_MFS8_LIN_ESCR_LBIE                    *((volatile  uint8_t *)(0x42710090UL))
#define bFM4_MFS8_LIN_ESCR_LBIE                   *((volatile  uint8_t *)(0x42710090UL))
#define bFM_MFS8_LIN_ESCR_ESBL                    *((volatile  uint8_t *)(0x42710098UL))
#define bFM4_MFS8_LIN_ESCR_ESBL                   *((volatile  uint8_t *)(0x42710098UL))

#define bFM_MFS8_LIN_FCR_FE1                      *((volatile  uint8_t *)(0x42710280UL))
#define bFM4_MFS8_LIN_FCR_FE1                     *((volatile  uint8_t *)(0x42710280UL))
#define bFM_MFS8_LIN_FCR_FE2                      *((volatile  uint8_t *)(0x42710284UL))
#define bFM4_MFS8_LIN_FCR_FE2                     *((volatile  uint8_t *)(0x42710284UL))
#define bFM_MFS8_LIN_FCR_FCL1                     *((volatile  uint8_t *)(0x42710288UL))
#define bFM4_MFS8_LIN_FCR_FCL1                    *((volatile  uint8_t *)(0x42710288UL))
#define bFM_MFS8_LIN_FCR_FCL2                     *((volatile  uint8_t *)(0x4271028CUL))
#define bFM4_MFS8_LIN_FCR_FCL2                    *((volatile  uint8_t *)(0x4271028CUL))
#define bFM_MFS8_LIN_FCR_FSET                     *((volatile  uint8_t *)(0x42710290UL))
#define bFM4_MFS8_LIN_FCR_FSET                    *((volatile  uint8_t *)(0x42710290UL))
#define bFM_MFS8_LIN_FCR_FLD                      *((volatile  uint8_t *)(0x42710294UL))
#define bFM4_MFS8_LIN_FCR_FLD                     *((volatile  uint8_t *)(0x42710294UL))
#define bFM_MFS8_LIN_FCR_FLST                     *((volatile  uint8_t *)(0x42710298UL))
#define bFM4_MFS8_LIN_FCR_FLST                    *((volatile  uint8_t *)(0x42710298UL))
#define bFM_MFS8_LIN_FCR_FSEL                     *((volatile  uint8_t *)(0x427102A0UL))
#define bFM4_MFS8_LIN_FCR_FSEL                    *((volatile  uint8_t *)(0x427102A0UL))
#define bFM_MFS8_LIN_FCR_FTIE                     *((volatile  uint8_t *)(0x427102A4UL))
#define bFM4_MFS8_LIN_FCR_FTIE                    *((volatile  uint8_t *)(0x427102A4UL))
#define bFM_MFS8_LIN_FCR_FDRQ                     *((volatile  uint8_t *)(0x427102A8UL))
#define bFM4_MFS8_LIN_FCR_FDRQ                    *((volatile  uint8_t *)(0x427102A8UL))
#define bFM_MFS8_LIN_FCR_FRIIE                    *((volatile  uint8_t *)(0x427102ACUL))
#define bFM4_MFS8_LIN_FCR_FRIIE                   *((volatile  uint8_t *)(0x427102ACUL))
#define bFM_MFS8_LIN_FCR_FLSTE                    *((volatile  uint8_t *)(0x427102B0UL))
#define bFM4_MFS8_LIN_FCR_FLSTE                   *((volatile  uint8_t *)(0x427102B0UL))

#define bFM_MFS8_LIN_SCR_TXE                      *((volatile  uint8_t *)(0x42710020UL))
#define bFM4_MFS8_LIN_SCR_TXE                     *((volatile  uint8_t *)(0x42710020UL))
#define bFM_MFS8_LIN_SCR_RXE                      *((volatile  uint8_t *)(0x42710024UL))
#define bFM4_MFS8_LIN_SCR_RXE                     *((volatile  uint8_t *)(0x42710024UL))
#define bFM_MFS8_LIN_SCR_TBIE                     *((volatile  uint8_t *)(0x42710028UL))
#define bFM4_MFS8_LIN_SCR_TBIE                    *((volatile  uint8_t *)(0x42710028UL))
#define bFM_MFS8_LIN_SCR_TIE                      *((volatile  uint8_t *)(0x4271002CUL))
#define bFM4_MFS8_LIN_SCR_TIE                     *((volatile  uint8_t *)(0x4271002CUL))
#define bFM_MFS8_LIN_SCR_RIE                      *((volatile  uint8_t *)(0x42710030UL))
#define bFM4_MFS8_LIN_SCR_RIE                     *((volatile  uint8_t *)(0x42710030UL))
#define bFM_MFS8_LIN_SCR_LBR                      *((volatile  uint8_t *)(0x42710034UL))
#define bFM4_MFS8_LIN_SCR_LBR                     *((volatile  uint8_t *)(0x42710034UL))
#define bFM_MFS8_LIN_SCR_MS                       *((volatile  uint8_t *)(0x42710038UL))
#define bFM4_MFS8_LIN_SCR_MS                      *((volatile  uint8_t *)(0x42710038UL))
#define bFM_MFS8_LIN_SCR_UPCL                     *((volatile  uint8_t *)(0x4271003CUL))
#define bFM4_MFS8_LIN_SCR_UPCL                    *((volatile  uint8_t *)(0x4271003CUL))

